fluidisedBed/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    interfaceCompositionPhaseChangeMultiphaseSystem;							  		   
phases          (particles gas);

referencePhase air;

particles
{
	type          purePhaseModel;							 
    diameterModel constant;
    constantCoeffs
    {
        d               3e-4;
    }

    alphaMax        0.62;
    residualAlpha   1e-6;
}

gas
{
	type          reactingPhaseModel;							 
    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }
	Sct             0.7;

    residualAlpha   0;
}

blending
{
    default
    {
        type            linear;
		minFullyContinuousAlpha.gas 0.7;
        minPartlyContinuousAlpha.gas 0.3;
        minFullyContinuousAlpha.particles 0.7;
        minPartlyContinuousAlpha.particles 0.3;
    }
}

surfaceTension
(
    (gas and particles)
    {
        type            constant;
        sigma           0.00;
    }
);

interfaceCompression
(
);



aspectRatio
(
);

drag
(
    (particles in gas)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (particles in gas)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer.gas
(
    (gas in particles)
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }

    (particles in gas)
    {
        type spherical;
        residualAlpha 1e-4;
    }
);

heatTransfer.particles
(
    (gas in particles)
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }

    (particles in gas)
    {
        type spherical;
        residualAlpha 1e-4;
    }
);

phaseTransfer
(
);			 

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
